app/Controllers/api/FichaApi.php

    public function minhaFicha()
    {
        $usuario = session()->get('usuarioLogado');
        $cpf     = $this->request->getGet('cpf');
        $id      = $this->request->getGet('id');

        $model = new FichaModel();

        if ($usuario) {
            $minhaFicha = $model
                ->where('usuario_id', $usuario['id'])
                ->orderBy('criado_em', 'DESC')
                ->first();
---
SELECT *
FROM `fichas`
WHERE `usuario_id` = '3'
ORDER BY `criado_em` DESC
 LIMIT 1