app/Controllers/admin/FichaController.php

    public function apiListar()
    {
        $usuarioLogado = session()->get('usuarioLogado');
        if (!$usuarioLogado || !in_array($usuarioLogado['role'], ['admin', 'diretor'])) {
            return $this->response->setStatusCode(403)->setJSON(['error' => 'Acesso negado']);
        }

        $postoId = $usuarioLogado['posto_id'] ?? null;
        $fichaModel = new FichaModel();

        $fichas = $fichaModel
            ->where('posto_id', $postoId)
            ->orderBy('criado_em', 'ASC')
            ->findAll();
---
SELECT *
FROM `fichas`
WHERE `posto_id` = '1'
ORDER BY `criado_em` ASC