app/Controllers/admin/FichaController.php

SELECT *
FROM `usuarios`
WHERE `is_admin` = 0
---
public function index()
{
    $usuario = session()->get('usuarioLogado');

    if (!is_array($usuario) || !isset($usuario['is_admin']) || !$usuario['is_admin']) {
        return redirect()->to('/fila'); // redireciona usuário comum para a tela pública
    }

    $model = new FichaModel();

    $statusFiltro = $this->request->getGet('status');
    $builder = $model->orderBy('criado_em', 'ASC');

    if ($statusFiltro && in_array($statusFiltro, ['aguardando', 'em_atendimento', 'atendido'])) {
        $builder->where('status', $statusFiltro);
    }

    $fichas = $builder->findAll();

    $posicaoFila = 1;
    foreach ($fichas as &$ficha) {
        if ($ficha['status'] === 'aguardando') {
            $ficha['posicao'] = $posicaoFila++;
        } else {
            $ficha['posicao'] = '—';
        }
    }

    // 🔽 Adiciona usuários para o modal de criação
    $usuarioModel = new \App\Models\UsuarioModel();
    $usuarios = $usuarioModel->where('is_admin', 0)->findAll();

SELECT *
FROM `usuarios`
WHERE `is_admin` = 0
---
    public function create()
    {
        $usuarioModel = new UsuarioModel();
        $usuarios = $usuarioModel->where('is_admin', 0)->findAll(); // apenas usuários comuns

SELECT *
FROM `usuarios`
WHERE `cpf` = '11122233301'
 LIMIT 1
INSERT INTO `fichas` (`usuario_id`, `nome_paciente`, `cpf`, `tipo_atendimento`, `status`, `criado_em`) VALUES ('3', 'Usuário 1', '11122233301', 'Clínico Geral', 'aguardando', '2025-06-26 20:36:40')
---
    public function store()
    {
        $usuarioModel = new \App\Models\UsuarioModel();
        $cpf = $this->request->getPost('cpf');
        $paciente = $usuarioModel->where('cpf', $cpf)->first();

        if (!$paciente) {
            return redirect()->back()->with('error', 'Paciente não encontrado.');
        }

        $model = new FichaModel();

        $model->save([
            'nome_paciente'    => $paciente['nome'],
            'cpf'              => $paciente['cpf'],
            'tipo_atendimento' => $this->request->getPost('tipo_atendimento'),
            'status'           => 'aguardando',
            'criado_em'        => date('Y-m-d H:i:s'),
        ]);