app/Controllers/Login.php

    public function autenticar()
    {
        $cpf   = $this->request->getPost('cpf');
        $senha = $this->request->getPost('senha');

        $model   = new UsuarioModel();
        $usuario = $model->where('cpf', $cpf)->first();
---
SELECT *
FROM `usuarios`
WHERE `cpf` = '00011122233'
 LIMIT 1