app/Controllers/Login.php

SELECT *
FROM `admins`
WHERE `cpf` = '00011122233'
 LIMIT 1
---
    public function autenticar()
    {
        $cpf   = $this->request->getPost('cpf');
        $senha = $this->request->getPost('senha');

        // Admin
        $admin = (new AdminModel())->where('cpf', $cpf)->first();