app/Controllers/MedicoController.php

SELECT *
FROM `medicos`
WHERE `usuario_id` = '2'
 LIMIT 1
SELECT *
FROM `fichas`
WHERE `medico_id` = '1'
AND `status` = 'em_atendimento'
ORDER BY `inicio_atendimento` ASC
---
    public function index()
    {
        $usuario = session()->get('usuarioLogado');

        // 🔹 Apenas médicos podem acessar
        if (!$usuario || $usuario['role'] !== 'medico') {
            return redirect()->to('/login');
        }

        $fichaModel = new FichaModel();
        $medicoModel = new MedicoModel();

        // 🔹 Busca o registro do médico vinculado a este usuário
        $medico = $medicoModel
            ->where('usuario_id', $usuario['id'])
            ->first();

        if (!$medico) {
            return view('medico/erro', ['mensagem' => 'Perfil de médico não encontrado.']);
        }

        // Fichas atribuídas a este médico e prontas (acolhidas)
        $fichasDisponiveis = $fichaModel
            ->where('medico_id', $medico['id'])
            ->where('status', 'acolhido')
            ->orderBy('criado_em', 'ASC')
            ->findAll();

        // Fichas em atendimento por este médico
        $fichasEmAtendimento = $fichaModel
            ->where('medico_id', $medico['id'])
            ->where('status', 'em_atendimento')
            ->orderBy('inicio_atendimento', 'ASC')
            ->findAll();

SELECT *
FROM `medicos`
WHERE `usuario_id` = '2'
 LIMIT 1
SELECT *
FROM `fichas`
WHERE `medico_id` = '1'
AND `status` IN ('acolhido','em_atendimento')
ORDER BY `criado_em` ASC
---
    public function apiFichas()
    {
        $usuario = session()->get('usuarioLogado');

        if (!$usuario || $usuario['role'] !== 'medico') {
            return $this->response->setStatusCode(403)->setJSON(['error' => 'Acesso negado']);
        }

        $medicoModel = new MedicoModel();
        $fichaModel = new FichaModel();

        $medico = $medicoModel->where('usuario_id', $usuario['id'])->first();
        if (!$medico) {
            return $this->response->setJSON(['fichas' => []]);
        }

        // apenas fichas atribuídas a este médico e prontas
        $fichas = $fichaModel
            ->where('medico_id', $medico['id'])
            ->where('status', 'acolhido')
            ->orderBy('criado_em', 'ASC')
            ->findAll();