app/Controllers/MedicoController.php

    public function apiFichas()
    {
        $usuario = session()->get('usuarioLogado');

        if (!$usuario || $usuario['role'] !== 'medico') {
            return $this->response->setStatusCode(403)->setJSON(['error' => 'Acesso negado']);
        }

        $medicoModel = new MedicoModel();
        $fichaModel  = new FichaModel();

        $medico = $medicoModel->where('usuario_id', $usuario['id'])->first();
        if (!$medico) {
            return $this->response->setJSON(['fichas' => []]);
        }

        $fichas = $fichaModel
            ->where('posto_id', $medico['posto_id'])
            ->where('status', 'acolhido')
            ->orderBy('prioridade_manchester', 'ASC')
            ->orderBy('criado_em', 'ASC')
            ->findAll();
---
SELECT *
FROM `medicos`
WHERE `usuario_id` = '7'
 LIMIT 1
SELECT *
FROM `fichas`
WHERE `posto_id` = '4'
AND `status` = 'acolhido'
ORDER BY `prioridade_manchester` ASC, `criado_em` ASC